py32-rs/py32-data/svd/PY32F072Exx.svd
        <register>
          <name>CCMR2_INPUT</name>
          <description>desc CCMR2:INPUT</description>
          <alternateRegister>CCMR2_OUTPUT</alternateRegister>
          <addressOffset>0x1C</addressOffset>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CC3S</name>
              <description>desc CC3S</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>IC3PSC</name>
              <description>desc IC3PSC</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>IC3F</name>
              <description>desc IC3F</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>CC4S</name>
              <description>desc CC4S</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC4PSC</name>
              <description>desc IC4PSC</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>IC4F</name>
              <description>desc IC4F</description>
              <bitRange>[15:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCER</name>
          <description>desc CCER</description>
          <addressOffset>0x20</addressOffset>
          <resetMask>0x3333</resetMask>
          <fields>
            <field>
              <name>CC1E</name>
              <description>desc CC1E</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CC1P</name>
              <description>desc CC1P</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CC2E</name>
              <description>desc CC2E</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CC2P</name>
              <description>desc CC2P</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CC3E</name>
              <description>desc CC3E</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CC3P</name>
              <description>desc CC3P</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CC4E</name>
              <description>desc CC4E</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CC4P</name>
              <description>desc CC4P</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CC4NP</name>
              <description>desc CC4NP</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNT</name>
          <description>desc CNT</description>
          <addressOffset>0x24</addressOffset>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>desc CNT</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PSC</name>
          <description>desc PSC</description>
          <addressOffset>0x28</addressOffset>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>PSC</name>
              <description>desc PSC</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ARR</name>
          <description>desc ARR</description>
          <addressOffset>0x2C</addressOffset>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ARR</name>
              <description>desc ARR</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR1</name>
          <description>desc CCR1</description>
          <addressOffset>0x34</addressOffset>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CCR1</name>
              <description>desc CCR1</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR2</name>
          <description>desc CCR2</description>
          <addressOffset>0x38</addressOffset>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CCR2</name>
              <description>desc CCR2</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR3</name>
          <description>desc CCR3</description>
          <addressOffset>0x3C</addressOffset>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CCR3</name>
              <description>desc CCR3</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR4</name>
          <description>desc CCR4</description>
          <addressOffset>0x40</addressOffset>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CCR4</name>
              <description>desc CCR4</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCR</name>
          <description>desc DCR</description>
          <addressOffset>0x48</addressOffset>
          <resetMask>0x1F1F</resetMask>
          <fields>
            <field>
              <name>DBA</name>
              <description>desc DBA</description>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>DBL</name>
              <description>desc DBL</description>
              <bitRange>[12:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAR</name>
          <description>desc DMAR</description>
          <addressOffset>0x4C</addressOffset>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DMAB</name>
              <description>desc DMAB</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
